[
  {
    "id": 1,
    "title": {
      "firstLine":"Développeur",
      "secondLine":"FULLSTACK"
    },
    "subtitle": {
      "firstLine":"Frédéric Basler",
      "secondLine":"Mon portfolio"
    },
    "color": "#BCE100",
    "description": ["Fort de mes 10 ans d'expérience en tant que graphiste web et print, j'ai acquis un regard créatif et une expertise pointue en matière de design.",

    "Cependant, j'ai compris que pour donner vie à mes idées et les rendre vraiment interactives, je devais me plonger corps et âme dans le monde du développement.",
    
    "Après une reconversion réussie en tant que développeur Full Stack et tout en restant fidèle à mes racines artistiques, je mets désormais mes compétences artistiques et techniques au service de la réalisation de sites, d'applications web et mobile performantes.",
    
    "Je suis fier de ce parcours atypique qui m'a permis d'enrichir mes connaissances dans des domaines très liés et de pouvoir proposer maintenant des solutions créatives, esthétiques et innovantes."]
  },
  {
    "id": 2,
    "title": {
      "firstLine":"Développeur",
      "secondLine":"FRONTEND"
    },
    "subtitle": {
      "firstLine":"Une approche",
      "secondLine":"Intuitive"
    },
    "color": "#3ECEC3",
    "description": ["En tant que développeur Front-End, mon objectif est de créer des expériences utilisateur agréables, intuitives et esthétiquement attrayantes.",

    "Grâce à ma maîtrise des langages de programmation tels que HTML, CSS et JavaScript, React je suis en mesure de transformer les concepts et les maquettes graphiques en interfaces interactives.", 
    "Je m'assure que les sites web et les applications que je développe fonctionnent parfaitement sur différentes plateformes et navigateurs, en veillant à ce qu'ils soient responsives et optimisés pour une expérience utilisateur fluide."]
  },
  {
    "id": 3,
    "title": {
      "firstLine":"Développeur",
      "secondLine":"BACKEND"
    },
    "subtitle": {
      "firstLine":"Une approche",
      "secondLine":"Logique"
    },
    "color": "#6A2AFF",
    "description": ["En tant que développeur Back-End, mon objectif consiste à construire des systèmes robustes, évolutifs et sécurisés qui manipulent les données, assurent les connexions aux BDD, et maintiennent les serveurs en marche.", 
    
    "Pour accomplir cette tâche, je me sers de langages de programmation tels que Node.js et Express pour construire les serveurs et les API. J'utilise également des langages de requête comme SQL et PostgreSQL pour manipuler les données stockées dans les bases de données.",

    "Je veille à la sécurisation des données et à une gestion efficace des connexions aux bases de données, garantissant ainsi la fiabilité et les performances du système. Mon objectif est d'intégrer les fonctionnalités du site web ou de l'application de manière transparente, tout en assurant la sécurité des données."]
  },
  {
    "id": 4,
    "title": {
      "firstLine":"Graphiste",
      "secondLine":"WEBDESIGNER"
    },
    "subtitle": {
      "firstLine":"Une approche",
      "secondLine":"Créative"
    },
    "color": "#FF3679",
    "description": ["En tant que graphiste, mon objectif est de transformer les idées en images percutantes qui captivent l'attention et communiquent efficacement un message.",

    "Grâce à ma formation et à mon expérience en tant que Graphiste Webdesigner et Print, je suis en mesure de créer des visuels attrayants, des logos accrocheurs, des illustrations percutantes et des mises en page créatives.", 
    
    "Mon approche créative et mon souci du détail me permettent de fournir des solutions graphiques de haute qualité qui renforcent l'identité visuelle d'une marque, tout en maintenant une esthétique moderne et en suivant les tendances actuelles."]
  }
]